package service

import (
	"github.com/FilinItPark/tg-bot-notifyer/internal/domain"
	"math/rand/v2"
	"strings"
	"time"
)

type Service struct {
}

func New() *Service {
	return &Service{}
}

func getRandomGreeting() string {
	var greetings = []string{
		"С днем рождения, {Имя}! Пусть этот день будет наполнен радостью и счастьем! Желаю тебе ярких моментов и исполнения всех мечт!",
		"Поздравляю с днем рождения, {Имя}! Твоя улыбка всегда светит ярче всех звезд. Пусть этот день будет полон радости и улыбок!",
		"Дорогой(ая) {Имя}, с днем рождения! Твоя доброта и забота о других делают мир лучше. Желаю тебе счастья и благополучия!",
		"С днем рождения, {Имя}! Твоя энергия и оптимизм всегда вдохновляют нас. Пусть этот день будет полон позитива и новых возможностей!",
		"Поздравляю с днем рождения, {Имя}! Твоя преданность и трудолюбие достойны восхищения. Желаю тебе успехов и радостных моментов!",
		"С днем рождения, {Имя}! Твоя творческая натура делает нашу группу ярче и интереснее. Желаю тебе вдохновения и креативных успехов!",
		"Поздравляю с днем рождения, {Имя}! Твоя доброта и отзывчивость делают нашу группу дружелюбной и теплой. Желаю тебе счастья и удачи!",
		"{Имя}, с днем рождения! Твоя уверенность и настойчивость помогают тебе преодолевать любые препятствия. Пусть этот день будет полон побед и достижений!",
		"С днем рождения, {Имя}! Твоя улыбка и доброе сердце делают нашу группу единой и сильной. Желаю тебе радости и успехов во всем!",
		"Поздравляю с днем рождения, {Имя}! Твой интеллект и обаяние делают тебя неповторимым. Желаю тебе ярких эмоций и интересных открытий!",
		"Поздравляю тебя, {Имя}, с этим особенным днем! Пусть он будет наполнен радостью, любовью и прекрасными моментами!",
		"С днем рождения, {Имя}! Желаем чтобы каждый день был наполнен счастьем, успехом и новыми возможностями!",
		"Пусть этот день рождения, {Имя}, станет началом новой главы в твоей жизни, полной вдохновения и достижений!",
		"С днем рождения, {Имя}! Пусть каждый новый день приносит тебе радость, удачу и вдохновение. Желаю тебе достигать новых высот и никогда не останавливаться на достигнутом!",
		"Поздравляю с днем рождения, {Имя}! Желаю тебе счастья, как в сказке, здоровья, как у космонавта, и любви, как в романах. Пусть каждый день будет ярким и незабываемым!",
		"Дорогой(ая) {Имя}, в твой день рождения хочу пожелать тебе оставаться таким же ярким человеком, который светит для всех нас. Пусть твоя жизнь будет полна приключений и новых открытий!",
		"С днем рождения, {Имя}! Пусть этот год принесет тебе столько же радости и счастья, сколько ты даришь окружающим. Желаю тебе здоровья, успехов и исполнения самых заветных желаний!",
		"Поздравляю, {Имя}! В этот особенный день желаю тебе найти свой источник вдохновения и следовать за своими мечтами. Пусть поддержка близких и вера в себя будут твоими верными спутниками!",
		"С днем рождения, {Имя}! Желаю тебе оставаться таким же неутомимым искателем приключений, каким ты являешься. Пусть каждый новый день приносит что-то удивительное и неповторимое в твою жизнь!",
		"Поздравляю с днем рождения, {Имя}! Желаю тебе, чтобы твоя жизнь была наполнена яркими моментами, теплыми встречами и искренними улыбками. Пусть каждый день будет шагом к новым достижениям и победам!",
		"Самые теплые поздравления в твой день рождения, {Имя}! Желаю тебе океан счастья, горы успехов и реку вдохновения. Пусть каждый твой день будет наполнен смыслом и радостью!",
		"Поздравляю, {Имя}! В этот замечательный день хочу пожелать тебе невероятных приключений, волшебных моментов и истинного счастья. Пусть твоя жизнь будет такой же яркой и красочной, как ты сам(а)!",
		"Дорогой(ая) {Имя}, с днем рождения! Желаю тебе всегда оставаться на волне позитива, несмотря на все препятствия. Пусть у тебя будет достаточно сил и энергии для осуществления всех твоих мечт!",
		"С днем рождения, {Имя}! Пусть этот год принесет тебе много улыбок, добрых слов и приятных сюрпризов. Желаю тебе здоровья, любви и благополучия на каждый день!",
		"Поздравляю с днем рождения, {Имя}! Желаю тебе, чтобы каждый новый день был лучше предыдущего, а каждая мечта непременно сбывалась. Пусть в твоей жизни будет как можно больше ярких и счастливых моментов!",
		"С днем рождения, {Имя}! Желаю тебе всегда находить повод для смеха и радости, даже в самых обычных моментах. Пусть твоя жизнь будет полна вдохновляющих историй и незабываемых впечатлений!",
		"Поздравляю, {Имя}! В твой день рождения хочу пожелать тебе бесконечного счастья, искренних улыбок и настоящих друзей рядом. Пусть каждый день приносит тебе радость и удовлетворение от жизни!",
	}

	randomIndex := rand.IntN(len(greetings))

	return greetings[randomIndex]
}

func replaceName(greeting string, name string) string {
	return strings.Replace(greeting, "{Имя}", name, 1)
}

// CheckBirthdays пробегает по списку людей и смотрит, есть ли у кого-то сегодня день рождения
func (s *Service) CheckBirthdays() []string {
	currentDate := time.Now()

	var birthdaysToday []string
	for name, date := range domain.MapOfBirthdays {
		if date.Month() == currentDate.Month() && date.Day() == currentDate.Day() {
			birthdaysToday = append(birthdaysToday, replaceName(getRandomGreeting(), name))
		}
	}

	return birthdaysToday
}
